In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [31]:
np.random.seed(101)

In [32]:
df = pd.DataFrame(randn(5,5),['A','B','C','D','E'],[1,2,3,4,5])

In [33]:
df

          1         2         3         4         5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [11]:
df[1]

A    1.035125
B    0.187125
C   -2.141212
D   -1.467514
E    0.221491
Name: 1, dtype: float64

In [14]:
df[1]

A    1.035125
B    0.187125
C   -2.141212
D   -1.467514
E    0.221491
Name: 1, dtype: float64

In [15]:
df.shape

(5, 5)

In [16]:
df

          1         2         3         4         5
A  1.035125 -0.031160  1.939932 -1.005187 -0.741790
B  0.187125 -0.732845 -1.382920  1.482495  0.961458
C -2.141212  0.992573  1.192241 -1.046780  1.292765
D -1.467514 -0.494095 -0.162535  0.485809  0.392489
E  0.221491 -0.855196  1.541990  0.666319 -0.538235

In [18]:
df.loc['C',2]

0.9925734530526948

In [19]:
df.iloc[3,3]

0.48580873745486103

In [21]:
df.iloc[[3,-1],[3,-1]]

          4         5
D  0.485809  0.392489
E  0.666319 -0.538235

In [34]:
df

          1         2         3         4         5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [35]:
booldf = df >0

In [24]:
df<2

      1     2     3     4     5
A  True  True  True  True  True
B  True  True  True  True  True
C  True  True  True  True  True
D  True  True  True  True  True
E  True  True  True  True  True

In [25]:
df>2

       1      2      3      4      5
A  False  False  False  False  False
B  False  False  False  False  False
C  False  False  False  False  False
D  False  False  False  False  False
E  False  False  False  False  False

In [26]:
df>1

       1      2      3      4      5
A   True  False   True  False  False
B  False  False  False   True  False
C  False  False   True  False   True
D  False  False  False  False  False
E  False  False   True  False  False

In [37]:
booldf

       1      2      3      4      5
A   True   True   True   True   True
B  False  False   True  False   True
C   True  False   True  False  False
D   True   True   True   True   True
E   True   True  False  False  False

In [36]:
df[booldf]

          1         2         3         4         5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B       NaN       NaN  0.605965       NaN  0.740122
C  0.528813       NaN  0.188695       NaN       NaN
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723       NaN       NaN       NaN

In [38]:
df[df>0]

          1         2         3         4         5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B       NaN       NaN  0.605965       NaN  0.740122
C  0.528813       NaN  0.188695       NaN       NaN
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723       NaN       NaN       NaN

In [65]:
df[df[3] >0]

          1         2         3         4         5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [67]:
df[df[4]<0]

          1         2         3         4         5
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [71]:
df[5]

A    0.651118
B    0.740122
C   -0.933237
D    0.683509
E   -0.134841
Name: 5, dtype: float64

In [75]:
df = df.drop(5,axis =1)

In [76]:
df

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965 -2.018168
C  0.528813 -0.589001  0.188695 -0.758872
D  0.955057  0.190794  1.978757  2.605967
E  0.302665  1.693723 -1.706086 -1.159119

In [77]:
df.drop('E')

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965 -2.018168
C  0.528813 -0.589001  0.188695 -0.758872
D  0.955057  0.190794  1.978757  2.605967

In [127]:
df[df[4]<0][[2,3]]

               2         3
states
NJ     -0.848077  0.605965
DC     -0.589001  0.188695
FL      1.693723 -1.706086

In [123]:
df

       index         1         2         3         4
states
NY         A  2.706850  0.628133  0.907969  0.503826
NJ         B -0.319318 -0.848077  0.605965 -2.018168
DC         C  0.528813 -0.589001  0.188695 -0.758872
LA         D  0.955057  0.190794  1.978757  2.605967
FL         E  0.302665  1.693723 -1.706086 -1.159119

In [92]:
df[(df[3]>0) | (df[1]<0)]

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965 -2.018168
C  0.528813 -0.589001  0.188695 -0.758872
D  0.955057  0.190794  1.978757  2.605967

In [93]:
df

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965 -2.018168
C  0.528813 -0.589001  0.188695 -0.758872
D  0.955057  0.190794  1.978757  2.605967
E  0.302665  1.693723 -1.706086 -1.159119

In [95]:
df.reset_index( inplace= True)

In [96]:
df

  index         1         2         3         4
0     A  2.706850  0.628133  0.907969  0.503826
1     B -0.319318 -0.848077  0.605965 -2.018168
2     C  0.528813 -0.589001  0.188695 -0.758872
3     D  0.955057  0.190794  1.978757  2.605967
4     E  0.302665  1.693723 -1.706086 -1.159119

In [97]:
r = 'NY NJ DC LA FL'.split()

In [98]:
r

['NY', 'NJ', 'DC', 'LA', 'FL']

In [99]:
df['states']=r

In [100]:
df

  index         1         2         3         4 states
0     A  2.706850  0.628133  0.907969  0.503826     NY
1     B -0.319318 -0.848077  0.605965 -2.018168     NJ
2     C  0.528813 -0.589001  0.188695 -0.758872     DC
3     D  0.955057  0.190794  1.978757  2.605967     LA
4     E  0.302665  1.693723 -1.706086 -1.159119     FL

In [102]:
df.set_index('index')

              1         2         3         4 states
index
A      2.706850  0.628133  0.907969  0.503826     NY
B     -0.319318 -0.848077  0.605965 -2.018168     NJ
C      0.528813 -0.589001  0.188695 -0.758872     DC
D      0.955057  0.190794  1.978757  2.605967     LA
E      0.302665  1.693723 -1.706086 -1.159119     FL

In [110]:
df

  index         1         2         3         4 states
0     A  2.706850  0.628133  0.907969  0.503826     NY
1     B -0.319318 -0.848077  0.605965 -2.018168     NJ
2     C  0.528813 -0.589001  0.188695 -0.758872     DC
3     D  0.955057  0.190794  1.978757  2.605967     LA
4     E  0.302665  1.693723 -1.706086 -1.159119     FL

In [113]:
df.set_index('states', inplace = True)

In [115]:
df

       index         1         2         3         4
states
NY         A  2.706850  0.628133  0.907969  0.503826
NJ         B -0.319318 -0.848077  0.605965 -2.018168
DC         C  0.528813 -0.589001  0.188695 -0.758872
LA         D  0.955057  0.190794  1.978757  2.605967
FL         E  0.302665  1.693723 -1.706086 -1.159119

In [128]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [129]:
df = pd.DataFrame(randn(6,2),hier_index,['a','b'])

In [130]:
df

             a         b
G1 1  0.390528  0.166905
   2  0.184502  0.807706
   3  0.072960  0.638787
G2 1  0.329646 -0.497104
   2 -0.754070 -0.943406
   3  0.484752 -0.116773

In [132]:
df.loc['G1'].loc[1]

a    0.390528
b    0.166905
Name: 1, dtype: float64

In [134]:
df.index.names = ['groups','num']

In [135]:
df

                   a         b
groups num
G1     1    0.390528  0.166905
       2    0.184502  0.807706
       3    0.072960  0.638787
G2     1    0.329646 -0.497104
       2   -0.754070 -0.943406
       3    0.484752 -0.116773

In [137]:
df.loc['G2'].loc[2]['b']

-0.9434064032519315

In [138]:
df.loc['G1'].loc[3]['a']

0.07295967531703869

In [139]:
df.xs

<bound method NDFrame.xs of                    a         b
groups num
G1     1    0.390528  0.166905
       2    0.184502  0.807706
       3    0.072960  0.638787
G2     1    0.329646 -0.497104
       2   -0.754070 -0.943406
       3    0.484752 -0.116773>

In [140]:
df.xs('G1')

            a         b
num
1    0.390528  0.166905
2    0.184502  0.807706
3    0.072960  0.638787

In [144]:
df.xs(3,level= 'num')

               a         b
groups
G1      0.072960  0.638787
G2      0.484752 -0.116773

In [145]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [146]:
l = pd.DataFrame(d)

In [147]:
l

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [148]:
l.dropna()

     A    B  C
0  1.0  5.0  1

In [149]:
l

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [150]:
l.dropna(axis=1)

   C
0  1
1  2
2  3

In [151]:
l.drop_duplicates()

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [153]:
l.dropna(thresh = 2, axis = 0)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [154]:
l.fillna(value= 'rour')

      A     B  C
0     1     5  1
1     2  rour  2
2  rour  rour  3

In [155]:
l

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [160]:
l['A'].fillna(value= l['C'].mean())

0    1.0
1    2.0
2    2.0
Name: A, dtype: float64

In [163]:
l.groupby(level = -1,squeeze = True)

In [164]:
l

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [165]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [166]:
m= pd.DataFrame(data)

In [167]:
m

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [172]:
o = m.groupby('Company')

In [174]:
o.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [183]:
o.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [177]:
o.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [178]:
o

In [179]:
m

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [180]:
o.corr()

               Sales
Company
FB      Sales    1.0
GOOG    Sales    1.0
MSFT    Sales    1.0

In [181]:
o.size()

Company
FB      2
GOOG    2
MSFT    2
dtype: int64

In [182]:
o.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [197]:
m.groupby('Company'.capitalize()).mean()   .loc['GOOG']

Sales    160.0
Name: GOOG, dtype: float64

In [198]:
m

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [203]:
m.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [204]:
u=4